In [1]:
import findspark
findspark.init()

In [2]:
from pyspark.sql import SparkSession

#Create a SparkSession
spark = SparkSession.builder.appName("DataFrame-Sql").getOrCreate()

In [3]:
%%bash
head -10 ./data/persons.csv

name,age,gender,salary
John Doe,30,Male,50000
Jane Smith,25,Female,45000
David Johnson,35,Male,60000
Emily Davis,28,Female,52000
Michael Wilson,40,Male,75000
Sarah Brown,32,Female,58000
Robert Lee,29,Male,51000
Lisa Garcia,27,Female,49000
James Martinez,38,Male,70000

#### Load Data into a DataFrame

In [4]:
# Load the synthetic data into a DataFrame

data_file_path = "./data/persons.csv"
df = spark.read.csv(data_file_path, header=True, inferSchema=True)

In [5]:
#Display Schema of the dataframe
df.printSchema()

#Show file contents dataframe
df.show(5)

root
 |-- name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

+--------------+---+------+------+
|          name|age|gender|salary|
+--------------+---+------+------+
|      John Doe| 30|  Male| 50000|
|    Jane Smith| 25|Female| 45000|
| David Johnson| 35|  Male| 60000|
|   Emily Davis| 28|Female| 52000|
|Michael Wilson| 40|  Male| 75000|
+--------------+---+------+------+
only showing top 5 rows

### Register the DataFrame as a Temporary Table

In [6]:
# Register the DataFrame as a Temporary Table
df.createOrReplaceTempView("my_table")

### Perform SQL-like Queries

In [7]:
# Select all rows where age is greater than 25
result = spark.sql("SELECT * FROM my_table WHERE age >25")

result.show()

+--------------+---+------+------+
|          name|age|gender|salary|
+--------------+---+------+------+
|      John Doe| 30|  Male| 50000|
| David Johnson| 35|  Male| 60000|
|   Emily Davis| 28|Female| 52000|
|Michael Wilson| 40|  Male| 75000|
|   Sarah Brown| 32|Female| 58000|
|    Robert Lee| 29|  Male| 51000|
|   Lisa Garcia| 27|Female| 49000|
|James Martinez| 38|  Male| 70000|
|      Sulaiman| 28|  Male|100000|
+--------------+---+------+------+

In [8]:
# Compute the average salary by gender

avg_salary_by_gender = spark.sql("SELECT gender, AVG(salary) as avg_salary FROM my_table GROUP BY gender")

avg_salary_by_gender.show()

+------+-----------------+
|gender|       avg_salary|
+------+-----------------+
|Female|          51000.0|
|  Male|67666.66666666667|
+------+-----------------+

### Creating and managing temporary views

In [9]:
# Create a temporary view

df.createOrReplaceTempView("people")

In [10]:
# Query the temporary view

result = spark.sql("SELECT * FROM people where age > 27")

result.show()

+--------------+---+------+------+
|          name|age|gender|salary|
+--------------+---+------+------+
|      John Doe| 30|  Male| 50000|
| David Johnson| 35|  Male| 60000|
|   Emily Davis| 28|Female| 52000|
|Michael Wilson| 40|  Male| 75000|
|   Sarah Brown| 32|Female| 58000|
|    Robert Lee| 29|  Male| 51000|
|James Martinez| 38|  Male| 70000|
|      Sulaiman| 28|  Male|100000|
+--------------+---+------+------+

In [11]:
# Check if a temporary view exist 
view_exist = spark.catalog.tableExists("people")
view_exist

True

In [12]:
#Drop a Temporary view
spark.catalog.dropTempView("people")

True

In [13]:
# Check again if a temporary view exist
view_exist = spark.catalog.tableExists("people")
view_exist

False

### Subqueries

In [14]:
# Create DataFrame

employee_data = [
    (1, "John"), (2, "Alice"), (3, "Bob"), (4, "Emily"),
    (5, "David"), (6, "Sarah"), (7, "Michael"), (8, "Lisa"),
    (9, "William")
]

employees = spark.createDataFrame(employee_data, ["id","name"])

salary_data = [
    ("HR", 1, 60000), ("HR", 2, 55000), ("HR", 3, 58000),
    ("IT", 4, 70000), ("IT", 5, 72000), ("IT", 6, 68000),
    ("Sales", 7, 75000), ("Sales", 8, 78000), ("Sales", 9, 77000)
]

salaries = spark.createDataFrame(salary_data, ["department","id","salary"])

employees.show()

salaries.show()

+---+-------+
| id|   name|
+---+-------+
|  1|   John|
|  2|  Alice|
|  3|    Bob|
|  4|  Emily|
|  5|  David|
|  6|  Sarah|
|  7|Michael|
|  8|   Lisa|
|  9|William|
+---+-------+

+----------+---+------+
|department| id|salary|
+----------+---+------+
|        HR|  1| 60000|
|        HR|  2| 55000|
|        HR|  3| 58000|
|        IT|  4| 70000|
|        IT|  5| 72000|
|        IT|  6| 68000|
|     Sales|  7| 75000|
|     Sales|  8| 78000|
|     Sales|  9| 77000|
+----------+---+------+

In [15]:
# Register as a temporary view

employees.createOrReplaceTempView("employees")
salaries.createOrReplaceTempView("salaries")

In [16]:
view_exist = spark.catalog.tableExists("salaries")
view_exist

True

In [18]:
# Subquery to find employees with salaries above average
result = spark.sql("""
    SELECT name
    FROM employees
    WHERE id IN (
        SELECT id
        FROM salaries
        WHERE salary > (SELECT AVG(salary) FROM salaries)
    )
""")

result.show()

+-------+
|   name|
+-------+
|  Emily|
|  David|
|Michael|
|   Lisa|
|William|
+-------+

### Window Function

In [19]:
from pyspark.sql.window import Window
from pyspark.sql import functions as F

In [21]:
employee_salary = spark.sql("""
    select salaries.*, employees.name
    from salaries
    left join employees
    on salaries.id = employees.id
""")

employee_salary.show()

+----------+---+------+-------+
|department| id|salary|   name|
+----------+---+------+-------+
|        HR|  1| 60000|   John|
|        HR|  2| 55000|  Alice|
|        HR|  3| 58000|    Bob|
|        IT|  4| 70000|  Emily|
|        IT|  5| 72000|  David|
|        IT|  6| 68000|  Sarah|
|     Sales|  7| 75000|Michael|
|     Sales|  8| 78000|   Lisa|
|     Sales|  9| 77000|William|
+----------+---+------+-------+

In [22]:
# Create a window specification

window_spec = Window.partitionBy("department").orderBy(F.desc("salary"))

In [23]:
# Calculate the rank of employees within each department based on salary

employee_salary.withColumn("rank", F.rank().over(window_spec)).show()

+----------+---+------+-------+----+
|department| id|salary|   name|rank|
+----------+---+------+-------+----+
|        HR|  1| 60000|   John|   1|
|        HR|  3| 58000|    Bob|   2|
|        HR|  2| 55000|  Alice|   3|
|        IT|  5| 72000|  David|   1|
|        IT|  4| 70000|  Emily|   2|
|        IT|  6| 68000|  Sarah|   3|
|     Sales|  8| 78000|   Lisa|   1|
|     Sales|  9| 77000|William|   2|
|     Sales|  7| 75000|Michael|   3|
+----------+---+------+-------+----+

In [24]:
# Stop the SparkSession()

spark.stop()